from ._write_template import _write_template

DIBAO_PAYMENT_COLUMNS = [
    "序号", "人员编码", "家庭编码", "市名称", "县名称", "镇名称", "村名称", "救助类型",
    "人员姓名", "人员身份证号", "性别", "出生日期", "年龄", "民族", "和申请人关系",
    "共同生活家庭成员", "享受保障人口数", "家庭保障总金额", "家庭最低生活基本保障金",
    "家庭特殊困难补助金", "家庭调剂金额", "特殊困难情形（分类施保）", "特殊困难补助金",
    "是否渐退户", "文化程度", "婚姻状况", "就业状况", "劳动能力", "是否保障对象", "医保类型",
    "人员类别", "生活自理能力评估", "是否残疾", "残疾类别", "多重残疾种类", "残疾证号",
    "是否重残", "残疾等级", "残疾证有效期", "健康状况", "重病病种", "是否退役军人",
    "享受优抚待遇情况", "抚恤优待人员类别", "户籍地址", "现居地址", "个人月收入", "是否户主",
    "护理方式", "创建时间", "更新时间", "户籍类别", "初始享受时间", "始发年月",
    "本次开始发放年月", "享受状态", "证件类别", "供养类别", "供养机构", "特定救助对象类别",
    "年收入总额", "学业情况", "是否脱贫人口", "是否戒毒康复人员", "是否易地扶贫搬迁移民",
    "是否艾滋病/病机人员", "是否刑满释放人员", "是否重病", "单位名称", "单位性质", "就业地点",
    "学校名称", "学校类别", "入学时间", "临时救助人员类别", "备注",
]


def generate_dibao_payment_template(path):
    _write_template(path, "低保发放", DIBAO_PAYMENT_COLUMNS)
